#     0 1 2
# 0 : 2 2 0
# 1 : 2 0 1
# 2 : 0 1 1

n = int(input())

for i in range(n):  # пробігаємо по індексах рядків
    for j in range(n):  # пробігаємо по індексах стовпчиків
        # i == j - на головній діагоналі
        # i + j == n - 1 - на побічній діагоналі
        # i + j < n - 1 - вище побічної діагоналі
        # i + j > n - 1 - нижче побічної діагоналі
        if i + j == n - 1:
            print(0, end="")
        elif i + j < n - 1:
            print(2, end="")
        else:
            print(1, end="")
    print()